{
	"name": "hello",
	"me": "About me",
	"hi": "Hello",
	"welcome": "Welcome",
	"header_disc": "I’m Islomjon — a Developer. I’m very happy that you’re here to learn more about me. I wish you all the best, and feel free to explore my website.",
	"shior": "My motto",
	"shior_disc": "The best day is today! Today you can take action, today you can learn, today you can change, today you can pray. In short, you can do anything starting today. All you need is desire and pure intention. If you consider each day good, you will appreciate every second.",
	"section_title": "I'm a frontend developer and I know these technologies",
	"section_disc1": "Frontend Basics:",
	"section_disc1_1": "HTML5, CSS3, JavaScript (ES6+), Responsive design, mobile adaptability",
	"section_disc2": "React Ecosystem:",
	"section_disc2_2": "React.js, React Router, React Hooks, Redux Toolkit (global state management), React Query (data fetching & caching), Context API",
	"section_disc3": "UI & Styling:",
	"section_disc3_3": "Tailwind CSS, Styled-components, Sass or SCSS, Ant Design, Shadcn/ui, Framer Motion (animation)",
	"section_disc4": "Internationalization:",
	"section_disc4_4": "i18next, next-intl",
	"section_disc5": "Project Architecture & Design:",
	"section_disc5_5": "Next.js (App Router, SSR, ISR), Vite (fast dev environment), Component structure, Atomic design",
	"section_disc6": "Version Control:",
	"section_disc6_6": "Git and GitHub",
	"sec_1": "My Soft Skills",
	"sec_2": "Communication",
	"sec_3": "Clear expression of ideas, Teamwork, Professional communication with clients, Experience in sales and customer service (due to working in electronics stores)",
	"sec_4": "Problem Solving",
	"sec_5": "Identifying and fixing code errors, Detecting UI/UX issues to improve user experience, Solving technical or business problems independently",
	"sec_6": "Adaptability & Patience",
	"sec_7": "Quickly learning new technologies, Working under pressure, Dealing with diverse client and project requirements",
	"sec_8": "Time Management",
	"sec_9": "Delivering projects on time, Setting priorities, Following deadlines in freelance work",
	"sec_10": "Self-Development",
	"sec_11": "Regular sports activity, Daily reading, Deep curiosity about new knowledge",
	"me_disc": "Detailed information about me",
	"me_about": "Anvarov Islomjon Toxir ogli",
	"me_date": "I was born on April 8, 2005",
	"me_Adres": "Bekobod city, Tashkent region",
	"me_kurs": "I have completed the Frontend React course at Najot Ta'lim",
	"maqsad": "My goal is to become a top-level developer and work at one of the world's FAANG companies. To keep learning.",
	"intizom": "A disciplined life is my lifestyle. I always stick to it. I have grown through sports and knowledge.",
	"hobby": "Hobbies – I love ice sports and hockey games. Sometimes I enjoy table tennis."
}
