{
	"name": "selam",
	"me": "Өзім туралы",
	"hi": "Сәлеметсіз бе",
	"welcome": "Қош келдіңіз",
	"header_disc": "Мен — Исламжон, әзірлеушімін. Мен туралы көбірек білгіңіз келгені үшін қуаныштымын. Сізге жақсылық тілеймін және сайтты еркін шолуыңызға болады.",
	"shior": "Менің ұраным",
	"shior_disc": "Ең жақсы күн — бүгінгі күн! Бүгін әрекет ете аласыз, білім ала аласыз, өзгересіз, дұға жасай аласыз. Жалпы, бүгіннен бастап бәрін жасай аласыз. Тек ниет пен таза жүрек қажет. Әр күнді жақсы деп білсеңіз, әр секундтың қадірін түсінесіз.",
	"section_title": "Мен фронтенд әзірлеушімін және осы технологияларды білемін",
	"section_disc1": "Frontend негіздері:",
	"section_disc1_1": "HTML5, CSS3, JavaScript (ES6+), бейімделгіш дизайн, мобильді құрылғыларға ыңғайлану",
	"section_disc2": "React экожүйесі:",
	"section_disc2_2": "React.js, React Router, React Hooks, Redux Toolkit (жаһандық күйді басқару), React Query (мәліметтерді алу және кэштеу), Context API",
	"section_disc3": "UI және стильдеу:",
	"section_disc3_3": "Tailwind CSS, Styled-components, Sass немесе SCSS, Ant Design, Shadcn/ui, Framer Motion (анимация)",
	"section_disc4": "Интернационализация:",
	"section_disc4_4": "i18next, next-intl",
	"section_disc5": "Жоба архитектурасы мен дизайны:",
	"section_disc5_5": "Next.js (App Router, SSR, ISR), Vite (жылдам әзірлеу ортасы), компоненттер құрылымы, атомдық дизайн",
	"section_disc6": "Нұсқаларды бақылау:",
	"section_disc6_6": "Git және GitHub",
	"sec_1": "Менің жұмсақ дағдыларым",
	"sec_2": "Коммуникация (қарым-қатынас жасау)",
	"sec_3": "Ойды анық жеткізу, Топпен жұмыс істеу, Клиенттермен кәсіби қарым-қатынас, Сауда және қызмет көрсету тәжірибесі (электроника дүкендерінде жұмыс істегеніме байланысты)",
	"sec_4": "Мәселе шешу",
	"sec_5": "Кодтағы қателерді табу және түзету, Пайдаланушы тәжірибесін жақсарту үшін UI/UX мәселелерін анықтау, Техникалық немесе бизнес мәселелерді өз бетінше шешу",
	"sec_6": "Бейімделгіштік және сабырлылық",
	"sec_7": "Жаңа технологияларды тез меңгеру, Қысым астында жұмыс істеу, Түрлі клиенттер мен жоба талаптарымен жұмыс істеу",
	"sec_8": "Уақытты басқару",
	"sec_9": "Жобаларды уақытында аяқтау, Басымдықтарды дұрыс қою, Фриланс жобаларда дедлайнға сәйкес жұмыс істеу",
	"sec_10": "Өзін-өзі дамыту",
	"sec_11": "Тұрақты түрде спортпен айналысу, Күн сайын кітап оқу, Жаңалықтарға деген зор қызығушылық",
	"me_disc": "Мен туралы толық ақпарат",
	"me_about": "Анваров Исламжон Тохир ұлы",
	"me_date": "2005 жылдың 8 сәуірінде туылдым",
	"me_Adres": "Ташкент облысы, Бекабад қаласы",
	"me_kurs": "Najot Ta'lim білім орталығында Frontend React курсынан өттім",
	"maqsad": "Мақсатым — үздік бағдарламашы болып, әлемдегі FAANG компанияларының бірінде жұмыс істеу. Білім алу.",
	"intizom": "Тәртіпті өмір — менің өмір салтым. Мен оны әрқашан ұстанамын. Спорт пен білім арқылы дамыдым.",
	"hobby": "Қызығушылықтарым – мұз спорты мен хоккей ойындарын жақсы көремін. Кейде үстел теннисінен ләззат аламын. Спортпен үнемі айналысқандықтан, таэквондоны жақсы меңгердім."
}
