{
	"name": "assalomu alaykum ar",
	"me": "معلومات عني",
	"hi": "السلام عليكم",
	"welcome": "مرحبًا بك",
	"header_disc": "أنا إسلامجون، مطوّر. أنا سعيد جدًا بزيارتك لموقعي للتعرّف عليّ. أتمنى لك كل الخير، وتفضل بتصفح الموقع بحرية.",
	"shior": "شعاري",
	"shior_disc": "أفضل يوم هو اليوم! يمكنك أن تتحرك اليوم، تتعلم اليوم، تتغير اليوم، وتصلي اليوم. باختصار، يمكنك أن تفعل كل شيء بدءًا من اليوم. فقط الإرادة والنية الصافية تكفيان. إذا اعتبرت كل يوم جيدًا، فستقدّر كل ثانية.",
	"section_title": "أنا مطور واجهات أمامية وأعرف هذه التقنيات",
	"section_disc1": "أساسيات الواجهة الأمامية:",
	"section_disc1_1": "HTML5، CSS3، JavaScript (ES6+)، تصميم متجاوب، التكيف مع الجوال",
	"section_disc2": "نظام React:",
	"section_disc2_2": "React.js، React Router، React Hooks، Redux Toolkit (إدارة الحالة العامة)، React Query (جلب وتخزين البيانات)، Context API",
	"section_disc3": "واجهة المستخدم والتنسيق:",
	"section_disc3_3": "Tailwind CSS، Styled-components، Sass أو SCSS، Ant Design، Shadcn/ui، Framer Motion (الرسوم المتحركة)",
	"section_disc4": "التعريب والدعم اللغوي:",
	"section_disc4_4": "i18next، next-intl",
	"section_disc5": "تصميم وهندسة المشاريع:",
	"section_disc5_5": "Next.js (App Router، SSR، ISR)، Vite (بيئة تطوير سريعة)، بنية المكونات، التصميم الذري",
	"section_disc6": "نظام التحكم في الإصدارات:",
	"section_disc6_6": "Git و GitHub",
	"sec_1": "مهاراتي الناعمة",
	"sec_2": "التواصل",
	"sec_3": "التعبير الواضح عن الأفكار، العمل الجماعي، التواصل المهني مع العملاء، خبرة في البيع وخدمة العملاء (نتيجة العمل في متاجر الإلكترونيات)",
	"sec_4": "حل المشكلات",
	"sec_5": "تحديد وإصلاح أخطاء الكود، اكتشاف مشكلات UI/UX لتحسين تجربة المستخدم، حل المشكلات التقنية أو التجارية بشكل مستقل",
	"sec_6": "المرونة والصبر",
	"sec_7": "اكتساب سريع للتقنيات الجديدة، القدرة على العمل تحت الضغط، التعامل مع متطلبات عملاء ومشاريع مختلفة",
	"sec_8": "إدارة الوقت",
	"sec_9": "تسليم المشاريع في الوقت المحدد، تحديد الأولويات، الالتزام بالمواعيد النهائية في الأعمال الحرة",
	"sec_10": "التطوير الذاتي",
	"sec_11": "ممارسة الرياضة بانتظام، قراءة الكتب يوميًا، فضول كبير تجاه التعلم والمعرفة الجديدة",
	"me_disc": "معلومات مفصلة عني",
	"me_about": "أنفاروف إسلامجون طاهر أوغلي",
	"me_date": "ولدت في 8 أبريل 2005",
	"me_Adres": "مدينة بيك آباد، ولاية طشقند",
	"me_kurs": "أنهيت دورة React Frontend في Najot Ta'lim",
	"maqsad": "هدفي أن أصبح مبرمجًا متميزًا والعمل في إحدى شركات FAANG العالمية. أريد اكتساب العلم.",
	"intizom": "الحياة المنضبطة هي أسلوبي في الحياة. ألتزم بها دائمًا. تطورت من خلال الرياضة والعلم.",
	"hobby": "الهوايات – أحب الرياضات الجليدية وألعاب الهوكي. أحيانًا أستمتع بتنس الطاولة. نظرًا لأنني أمارس الرياضة بانتظام، فقد أتقنت التايكوندو جيدًا."
}
